In [3]:
# Load pandas, numpy
import pandas as pd
import numpy as np 
import missingno as msno
import matplotlib.pyplot as plt



# Load the daily report to a data frame
df = pd.read_json('soal-2.json')

# View summary stats about pop_in_shelters
print(df.describe())

       komoditas berat
count       1054  1054
unique       437   400
top         lele   3kg
freq         192    64

In [4]:
df.head()

,komoditas,berat
0,"lele, bawal, nila","lele 6kg, bawal 1kg, nila 1kg"
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,"ikan nila, kakap, lele, bawal, kembung, salam",rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,"lele, kerapu, ikan mas, pindang tongkol, gurame",rata2 1kg

`Note`: 
this data separate with whitespace and commas, so you have to make separate function and run twice each

In [5]:
df

,komoditas,berat
0,"lele, bawal, nila","lele 6kg, bawal 1kg, nila 1kg"
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,"ikan nila, kakap, lele, bawal, kembung, salam",rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,"lele, kerapu, ikan mas, pindang tongkol, gurame",rata2 1kg
...,...,...
1049,ikan lele,3kg
1050,"mas, mujaer","5,5"
1051,"ikan mas, lele, bawal, mujair",5
1052,"tongkol, nila","4,5"
1053,"ikan mas, lele,tongkol",4kg

In [6]:
print(df.head())

                                         komoditas  \
0                                lele, bawal, nila
1                 kakap lele kembung tongkol salem
2    ikan nila, kakap, lele, bawal, kembung, salam
3                  nila kembung tongkol lele bawal
4  lele, kerapu, ikan mas, pindang tongkol, gurame

                                               berat
0                      lele 6kg, bawal 1kg, nila 1kg
1  kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2                      rata2 1kg kecuali kembung 2kg
3  nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4                                          rata2 1kg

0                           lele 6kg, bawal 1kg, nila 1kg
1       kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2                           rata2 1kg kecuali kembung 2kg
3       nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4                                               rata2 1kg
                              ...
1049                                                  3kg
1050                                                  5,5
1051                                                    5
1052                                                  4,5
1053                                                  4kg
Name: berat, Length: 1054, dtype: object

In [7]:
df.head()

,komoditas,berat
0,"lele, bawal, nila","lele 6kg, bawal 1kg, nila 1kg"
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,"ikan nila, kakap, lele, bawal, kembung, salam",rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,"lele, kerapu, ikan mas, pindang tongkol, gurame",rata2 1kg

In [8]:
# improt chain from itertools
import numpy as np
from itertools import chain

In [9]:
# print the length of splits
lens = df['komoditas'].str.split(',').map(len)

In [10]:
print(lens)

0       3
1       1
2       6
3       1
4       5
       ..
1049    1
1050    2
1051    4
1052    2
1053    3
Name: komoditas, Length: 1054, dtype: int64

In [11]:
# make the fuction to chain the iterable split of the rows
def chainer(s): 
    return list(chain.from_iterable(s.str.split(',')))

In [12]:
# creating the new dataframe, and repneating or chaining as appropriate

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054 entries, 0 to 1053
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   komoditas  1054 non-null   object
 1   berat      1054 non-null   object
dtypes: object(2)
memory usage: 16.6+ KB

In [14]:
# convert to excel to see the whole data describtive
df.to_excel("output_efishery_task2.xlsx")

# delete unnecessary data
if the content not the same lengt > delete

In [15]:
lens_berat = df['berat'].str.split(',').map(len)

lens_komoditas = df['komoditas'].str.split(',').map(len)

In [16]:
lens_berat

0       3
1       1
2       1
3       1
4       1
       ..
1049    1
1050    2
1051    1
1052    2
1053    1
Name: berat, Length: 1054, dtype: int64

In [17]:
lens_komoditas

0       3
1       1
2       6
3       1
4       5
       ..
1049    1
1050    2
1051    4
1052    2
1053    3
Name: komoditas, Length: 1054, dtype: int64

if the program doesnt meet the require conditions, so delete it

# replace commas with whitespace

In [18]:
# replace comma with whitespace 
df2 = df.apply(lambda x: x.str.replace(', ', ' '))

In [19]:
# replace comma with whitespace again
df2 = df2.apply(lambda x: x.str.replace(',', ' '))

In [20]:
df2

,komoditas,berat
0,lele bawal nila,lele 6kg bawal 1kg nila 1kg
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,ikan nila kakap lele bawal kembung salam,rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,lele kerapu ikan mas pindang tongkol gurame,rata2 1kg
...,...,...
1049,ikan lele,3kg
1050,mas mujaer,5 5
1051,ikan mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,ikan mas lele tongkol,4kg

In [21]:
# delete ikan string replace with white space
df2 = df2.apply(lambda x: x.str.replace('ikan', ''))

In [22]:
df2

,komoditas,berat
0,lele bawal nila,lele 6kg bawal 1kg nila 1kg
1,kakap lele kembung tongkol salem,kakap 2kg lele 1kg kembung 1kg tongkol 1kg sal...
2,nila kakap lele bawal kembung salam,rata2 1kg kecuali kembung 2kg
3,nila kembung tongkol lele bawal,nila 1kg bawal 2kg kembung 5kg lele 2kg tongko...
4,lele kerapu mas pindang tongkol gurame,rata2 1kg
...,...,...
1049,lele,3kg
1050,mas mujaer,5 5
1051,mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,mas lele tongkol,4kg

In [23]:
# remove kg 
df2 = df2.apply(lambda x: x.str.replace('kg', ' '))

In [24]:
df2

,komoditas,berat
0,lele bawal nila,lele 6 bawal 1 nila 1
1,kakap lele kembung tongkol salem,kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,nila kakap lele bawal kembung salam,rata2 1 kecuali kembung 2
3,nila kembung tongkol lele bawal,nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,lele kerapu mas pindang tongkol gurame,rata2 1
...,...,...
1049,lele,3
1050,mas mujaer,5 5
1051,mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,mas lele tongkol,4

In [25]:
df2

,komoditas,berat
0,lele bawal nila,lele 6 bawal 1 nila 1
1,kakap lele kembung tongkol salem,kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,nila kakap lele bawal kembung salam,rata2 1 kecuali kembung 2
3,nila kembung tongkol lele bawal,nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,lele kerapu mas pindang tongkol gurame,rata2 1
...,...,...
1049,lele,3
1050,mas mujaer,5 5
1051,mas lele bawal mujair,5
1052,tongkol nila,4 5
1053,mas lele tongkol,4

In [58]:
df2.explode('komoditas')

     komoditas            berat
0         lele        [6, 1, 1]
0        bawal        [6, 1, 1]
0         nila        [6, 1, 1]
1        kakap  [2, 1, 1, 1, 1]
1         lele  [2, 1, 1, 1, 1]
...        ...              ...
1052   tongkol           [4, 5]
1052      nila           [4, 5]
1053       mas              [4]
1053      lele              [4]
1053   tongkol              [4]

[2556 rows x 2 columns]

In [27]:
df2['komoditas'] = df2['komoditas'].str.split()

In [28]:
df2

,komoditas,berat
0,"[lele, bawal, nila]",lele 6 bawal 1 nila 1
1,"[kakap, lele, kembung, tongkol, salem]",kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,"[nila, kakap, lele, bawal, kembung, salam]",rata2 1 kecuali kembung 2
3,"[nila, kembung, tongkol, lele, bawal]",nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,"[lele, kerapu, mas, pindang, tongkol, gurame]",rata2 1
...,...,...
1049,[lele],3
1050,"[mas, mujaer]",5 5
1051,"[mas, lele, bawal, mujair]",5
1052,"[tongkol, nila]",4 5
1053,"[mas, lele, tongkol]",4

In [29]:
df2

,komoditas,berat
0,"[lele, bawal, nila]",lele 6 bawal 1 nila 1
1,"[kakap, lele, kembung, tongkol, salem]",kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,"[nila, kakap, lele, bawal, kembung, salam]",rata2 1 kecuali kembung 2
3,"[nila, kembung, tongkol, lele, bawal]",nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,"[lele, kerapu, mas, pindang, tongkol, gurame]",rata2 1
...,...,...
1049,[lele],3
1050,"[mas, mujaer]",5 5
1051,"[mas, lele, bawal, mujair]",5
1052,"[tongkol, nila]",4 5
1053,"[mas, lele, tongkol]",4

# using `re` to remove unecessary komoditas on berat, using this regex

In [31]:
# import regular expression
import re

In [32]:
df2

,komoditas,berat
0,"[lele, bawal, nila]",lele 6 bawal 1 nila 1
1,"[kakap, lele, kembung, tongkol, salem]",kakap 2 lele 1 kembung 1 tongkol 1 salem 1
2,"[nila, kakap, lele, bawal, kembung, salam]",rata2 1 kecuali kembung 2
3,"[nila, kembung, tongkol, lele, bawal]",nila 1 bawal 2 kembung 5 lele 2 tongkol 3
4,"[lele, kerapu, mas, pindang, tongkol, gurame]",rata2 1
...,...,...
1049,[lele],3
1050,"[mas, mujaer]",5 5
1051,"[mas, lele, bawal, mujair]",5
1052,"[tongkol, nila]",4 5
1053,"[mas, lele, tongkol]",4

In [33]:
# list that will remove on this df
To_remove_lst = ["lele", "bawal", "tongkol", "salem", "rata2", "kembung", "kecuali", "kakap", "nila"]

In [34]:
# remove list using regex (regular expression)
df2['berat'] = df2['berat'].str.replace('|'.join(map(re.escape, To_remove_lst)), '')

In [35]:
df2

                                          komoditas                berat
0                               [lele, bawal, nila]           6   1   1
1            [kakap, lele, kembung, tongkol, salem]   2   1   1   1   1
2        [nila, kakap, lele, bawal, kembung, salam]              1    2
3             [nila, kembung, tongkol, lele, bawal]   1   2   5   2   3
4     [lele, kerapu, mas, pindang, tongkol, gurame]                   1
...                                             ...                  ...
1049                                         [lele]                   3
1050                                  [mas, mujaer]                  5 5
1051                     [mas, lele, bawal, mujair]                    5
1052                                [tongkol, nila]                  4 5
1053                           [mas, lele, tongkol]                   4

[1054 rows x 2 columns]

In [36]:
df2.to_excel("unclean_data_fish.xlsx")

`Note`: this done for removing unnescessary string usign regex but, the problem is how to make function to explode each with special conditions, for insance is, multiple list with single list on a rows

# explode the rows with the unequal lens


1. make function to explode rows with different lens
2. if len(df) == 2:

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [48]:
df2

                                          komoditas                berat
0                               [lele, bawal, nila]           6   1   1
1            [kakap, lele, kembung, tongkol, salem]   2   1   1   1   1
2        [nila, kakap, lele, bawal, kembung, salam]              1    2
3             [nila, kembung, tongkol, lele, bawal]   1   2   5   2   3
4     [lele, kerapu, mas, pindang, tongkol, gurame]                   1
...                                             ...                  ...
1049                                         [lele]                   3
1050                                  [mas, mujaer]                  5 5
1051                     [mas, lele, bawal, mujair]                    5
1052                                [tongkol, nila]                  4 5
1053                           [mas, lele, tongkol]                   4

[1054 rows x 2 columns]

In [52]:
df2['berat'] = df2['berat'].str.split()

In [53]:
df2

                                          komoditas            berat
0                               [lele, bawal, nila]        [6, 1, 1]
1            [kakap, lele, kembung, tongkol, salem]  [2, 1, 1, 1, 1]
2        [nila, kakap, lele, bawal, kembung, salam]           [1, 2]
3             [nila, kembung, tongkol, lele, bawal]  [1, 2, 5, 2, 3]
4     [lele, kerapu, mas, pindang, tongkol, gurame]              [1]
...                                             ...              ...
1049                                         [lele]              [3]
1050                                  [mas, mujaer]           [5, 5]
1051                     [mas, lele, bawal, mujair]              [5]
1052                                [tongkol, nila]           [4, 5]
1053                           [mas, lele, tongkol]              [4]

[1054 rows x 2 columns]

In [55]:
df2

                                          komoditas            berat
0                               [lele, bawal, nila]        [6, 1, 1]
1            [kakap, lele, kembung, tongkol, salem]  [2, 1, 1, 1, 1]
2        [nila, kakap, lele, bawal, kembung, salam]           [1, 2]
3             [nila, kembung, tongkol, lele, bawal]  [1, 2, 5, 2, 3]
4     [lele, kerapu, mas, pindang, tongkol, gurame]              [1]
...                                             ...              ...
1049                                         [lele]              [3]
1050                                  [mas, mujaer]           [5, 5]
1051                     [mas, lele, bawal, mujair]              [5]
1052                                [tongkol, nila]           [4, 5]
1053                           [mas, lele, tongkol]              [4]

[1054 rows x 2 columns]

In [56]:
# return list from series of comma-separated strings
def chainer(s):
    return list(chain.from_iterable(s.str.split(',')))

In [57]:
# create new dataframe, repeating or chaining as appropriate
res = pd.DataFrame({'komoditas': chainer(df['komoditas']),
                    'berat': chainer(df['berat'])})

ValueError: arrays must all be same length